#哈希表（Hash），也可以叫做散列表。哈希表是一种特殊的数据结构，它与数组、链表以及我们之前学到过的数据结构相比，有很明显的区别。
# 它可以提供快速插入和查找的操作，不论哈希表中有多少数据，我们对其进行操作时，平均时间复杂度接近于O(1)，也就是常数时间。
#哈希表的原理：它利用哈希函数将给定的键（key）映射到数据的存储位置。通过哈希函数可以快速插入、查找、删除数据
#哈希函数：是用于计算对象的哈希值的一种内置机制，它对于支持哈希操作（如字典dict 的 key）的对象非常重要。
#哈希函数的目标是将任意大小、复杂度各异的数据（如字符串、整数、自定义对象等）转换为固定长度的整数，这个整数称为哈希值（或散列值）。
#哈希值主要用于快速查找、比较和索引数据，特别是在实现哈希表这样的数据结构时。
#注意：可变的对象通常是不可哈希的，因为他们的值可以改变，这会导致哈希值不一致。
#由于哈希表大小有限，而需要我们存储的数据总量再增大，总会发生哈希冲突。即不同key值通过哈希函数后会产生相同的地址。
# 一般来说，哈希冲突是无法避免的，所以我们计算机科学家，就提出了几种解决办法：
#开放寻址法：如果发生了哈希冲突，则可以向后探查新的位置来存储这个值。
#链地址法（拉链法）：哈希表的每个位置都链接一个链表，当冲突发生的时候，冲突的元素将被加到该位置的链表最后。
#在Python中有一个内置的数据结构，可以实现哈希表的功能，它就是字典（dictionary）。
#Python字典（dict）是一种无序的、可变的集合，他的元素以“键值对（key-value）”的形式存储。 
# 字典中的key是唯一的且不可变的，这意味着它们一旦设置就无法更改。
#在底层，Python的字典以哈希表的形式运行，当我们创建字典并添加键值时，Python会将哈希函数作用于键，从而生成哈希值，
# 接着哈希值决定对应的值将存储在内存的哪个位置中。
# 所以当我们检索的时候，Python就会对键进行哈希，从而快速引导Python找到的位置，而无需考虑字典的大小。